/*---------------------------------------------------------------------------*/
/*-----作者：任杰文----------------------------------------------------------*/
/*---------------------------------------------------------------------------*/
#pragma once

/*---------------------------------------------------------------------------*/
/* ------------------------------定义探头FFT特性-----------------------------*/
/*---------------------------------------------------------------------------*/
typedef struct
{
	//衰减增益，为负值（db）
	float AttenuationGain;
	//低频(频率单位均为MHz)
	float LowFrequency;
	//高频
	float HighFrequency;
	//中心频率	
	float MiddleFrequency;
	//带宽频率
	float BandwidthFrequency;
	//带宽百分比（带宽 / 中心频率）
	float BandwidthPercent;
}STRUCT_FFT_PROPERTY;

